---
kind: property
id: P:Autodesk.Revit.DB.ParameterSet.Size
source: html/9572a8fe-3102-cd15-dd1a-eb19feb592a6.htm
---
# Autodesk.Revit.DB.ParameterSet.Size Property

Returns the number of parameters that are in the set.

## Syntax (C#)
```csharp
public virtual int Size { get; }
```